# Python Pandas Tutorial (Part 6):
## Add/Remove and Columns From DataFrams

In [11]:
people ={
    "first": ["corey", "jane", "john"],
    "last": ["schafer", "doe", "doe"],
    "email": ["coreyschafer@gmail.com", "janedoe@email.com", "johndoe@email.com"]
}

In [12]:
import pandas as pd

In [13]:
df = pd.DataFrame(people)

In [14]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      doe       janedoe@email.com
2   john      doe       johndoe@email.com

## Combine two columns

In [15]:
df["full_name"] = df["first"] + " " +df["last"]

In [16]:
df

   first     last                   email      full_name
0  corey  schafer  coreyschafer@gmail.com  corey schafer
1   jane      doe       janedoe@email.com       jane doe
2   john      doe       johndoe@email.com       john doe

## Remove Columns
#### <code>.drop()</code>

In [17]:
# lets delete firstt and last name columns
df.drop(columns=["first", "last"] , inplace = True)
df

                    email      full_name
0  coreyschafer@gmail.com  corey schafer
1       janedoe@email.com       jane doe
2       johndoe@email.com       john doe

## Add Columns
#### <code>.str.split(), .str.split(" ", expand = True)</code>

In [25]:
df["full_name"].str.split(" ", expand = True)

       0        1
0  corey  schafer
1   jane      doe
2   john      doe

In [26]:
df[["first", "last"]] = df["full_name"].str.split(" ", expand = True)

In [27]:
df

                    email      full_name  first     last
0  coreyschafer@gmail.com  corey schafer  corey  schafer
1       janedoe@email.com       jane doe   jane      doe
2       johndoe@email.com       john doe   john      doe

## Add and Remove ROWS of data

1) Add a single row to the data, <br>
2) Appending one dataframe to another.

### 1) Adding a single row of data <code> .append() </code>

In [30]:
df.append({"first": "marty"}, ignore_index=True)

                    email      full_name  first     last
0  coreyschafer@gmail.com  corey schafer  corey  schafer
1       janedoe@email.com       jane doe   jane      doe
2       johndoe@email.com       john doe   john      doe
3                     NaN            NaN  marty      NaN

### 2) Appending one dataframe to another dataframe

In [31]:
people ={
    "first": ["tony", "steve", ],
    "last": ["stark", "rogers", ],
    "email": ["ironMan@aa.com", "steveRogers@aa.com", ]
}

In [33]:
df2 = pd.DataFrame(people)
df2

   first    last               email
0   tony   stark      ironMan@aa.com
1  steve  rogers  steveRogers@aa.com

In [36]:
df.append(df2, ignore_index=True, sort = False)

                    email      full_name  first     last
0  coreyschafer@gmail.com  corey schafer  corey  schafer
1       janedoe@email.com       jane doe   jane      doe
2       johndoe@email.com       john doe   john      doe
3          ironMan@aa.com            NaN   tony    stark
4      steveRogers@aa.com            NaN  steve   rogers

#### To save the dataframe there is no inplace. instead:<br>
we are unsure why some have inplace, and others dont

In [37]:
df = df.append(df2, ignore_index=True, sort = False)

In [38]:
df

                    email      full_name  first     last
0  coreyschafer@gmail.com  corey schafer  corey  schafer
1       janedoe@email.com       jane doe   jane      doe
2       johndoe@email.com       john doe   john      doe
3          ironMan@aa.com            NaN   tony    stark
4      steveRogers@aa.com            NaN  steve   rogers

## Remove an Index ROW
<code>.drop()</code>

In [40]:
df.drop(index=4, inplace = True)

In [41]:
df

                    email      full_name  first     last
0  coreyschafer@gmail.com  corey schafer  corey  schafer
1       janedoe@email.com       jane doe   jane      doe
2       johndoe@email.com       john doe   john      doe
3          ironMan@aa.com            NaN   tony    stark

### Using conditions with <code>.drop()</code> and <code> .index</code>

In [43]:
df.drop(index=df[df['last'] == "doe"].index)

                    email      full_name  first     last
0  coreyschafer@gmail.com  corey schafer  corey  schafer
3          ironMan@aa.com            NaN   tony    stark

In [48]:
#Easier to read
filt = df['last'] == "doe"
df.drop(index=df[filt].index)

                    email      full_name  first     last
0  coreyschafer@gmail.com  corey schafer  corey  schafer
3          ironMan@aa.com            NaN   tony    stark